Repository: wp-plugins/selectel-storage-upload
Catalog: lang/selupload-*.po
Languages: be_by, uk_ua

source: Connection is successfully established. Save the settings.
be_by: Злучэнне паспяхова ўстаноўлена. Захавайце налады.
uk_ua: Підключення успішно встановлено. Зберегти налаштування.

source: Connection is not established.
be_by: Злучэнне з кантейнераз не ўстаноўлена. Праверце правільнасць наладак
uk_ua: З'єднання не встановлено.

source: Impossible to upload a file
be_by: Немагчыма загрузіць файл
uk_ua: Неможливо завантажити файл

source: Do not have access to the file
be_by: Файл не існуе ці недаступны для чытання
uk_ua: У вас немає доступу до файлу

source: Data empty
be_by: Дадзеныя пустыя
uk_ua: Дані порожні

source: Settings
be_by: Наладкі
uk_ua: Налаштування

source: Type the information for access to your container.
be_by: Калі ласка, увядзіце інфармацыю для доступу да вашага кантэйнера.
uk_ua: Введіть інформацію для доступу до контейнера.

source: No account? <a href ="http://goo.gl/8Z0q8H">Sign up</a>
be_by: Яшчэ няма ўліковага запісу? <a href ="http://goo.gl/8Z0q8H">Зарэгістравацца</a>
uk_ua: Ви не зареєстровані? <a href ="http://goo.gl/8Z0q8H"> Зареєструватися </a>

source: Username
be_by: Імя карыстальніка
uk_ua: Логін

source: Password
be_by: Пароль
uk_ua: Пароль

source: Container
be_by: Кантэйнер
uk_ua: Контейнер

source: Check the connection
be_by: Праверыць злучэнне
uk_ua: Перевірити підключення

source: Local path
be_by: Лакальны шлях
uk_ua: Локальний шлях

source: Local path to the uploaded files. By default
be_by: Лакальны шлях да загружаных файлаў. Па змаўчанні
uk_ua: Локальний шлях до завантажених файлів. За замовчуванням

source: Setting duplicates of the same name from the mediafiles settings. Changing one, you change and other
be_by: Налада дублюе аднайменную наладу ў медыяфайлах. Змяняючы адну, вы змяняеце і іншую
uk_ua: Налаштування дублює однойменну настройку в медіафайлах. Змінюючи одну, ви змінюєте й іншу.

source: Full URL-path to files
be_by: Поўны URL-шлях да файлаў
uk_ua: Повна адреса до файлів

source: Enter the domain or subdomain if store files only in the Selectel Storage
be_by: Калі ласка, увядзіце дамен альбо паддамен, калі захоўваеце файлы толькі ў Selectel Storage
uk_ua: Введіть адресу домену / піддомена, якщо файли зберігаються тільки в Selectel Storage

source: or full url path, if only used synchronization
be_by: або поўны URL шлях, калі выкарыстоўваецца толькі сінхранізацыя
uk_ua: або повний Url адресу, якщо використовується тільки синхронізація

source: Authorization server
be_by: Cервер аўтарызацыі
uk_ua: Сервер авторизації

source: By default
be_by: Па змаўчанні
uk_ua: За замовчуванням

source: Mask files
be_by: Маска файлаў
uk_ua: Маска файлів

source: for all files, 2 or more values separated by a comma (for example:
be_by: для ўсіх файлаў, 2 або больш значэнняў падзяляюцца коскамі (напрыклад:
uk_ua: для всіх файлів, 2 і більше значення розділяються комою (наприклад:

source: Synchronization settings
be_by: Наладкі сінхранізацыі
uk_ua: Налаштування синхронізації

source: Store files only in the Selectel Storage
be_by: Захоўваць файлы толькі ў Selectel Storage
uk_ua: Зберігати файли тільки в Selectel Storage

source: to attach a domain / subdomain to store and specify the settings
be_by: трэба дадаць дамен / паддамен да кантэйнера і азначыць гэта ў наладках
uk_ua: щоб не було "битих" посилань необхідно прикріпити домен / піддомен до контейнера в Selectel Storage і вказати його в налаштуваннях

source: The file will be deleted from the hosting after a successful download. It will only copy in the Selectel Storage
be_by: Файл будзе выдалены на хостынгу пасля паспяховай загрузкі. Яго копія застанецца толькі ў Selectel Storage
uk_ua: Файл буде видалений на хостингу після успішного завантаження. Його копія залишиться тільки в Selectel Storage

source: Delete files from the Selectel Storage if they are removed from the library
be_by: Выдаляць файлы з Selectel Storage, калі яны выдаляюцца з бібліятэкі
uk_ua: Видаляти файли з Selectel Storage, якщо вони були видалені з бібліотеки

source: Do not overwrite the file if it already exists in the storage
be_by: Не перазапісваць файл, калі ён ужо існуе у сховішчы
uk_ua: Чи не перезаписувати файл, якщо він вже є в сховищі

source: Enable debug mode. Do not enable unless you know what it is.
be_by: Ўключыць рэжым адладкі. Не ўключайце, калі вы не ведаеце, што гэта такое.
uk_ua: Включити режим налагодження. Не вмикайте, якщо не знаєте навіщо це.

source: Full synchronization
be_by: Поўная сінхранізацыя
uk_ua: Повна синхронізація

source: Show the list of files to synchronize
be_by: Файлы для сінхранізацыі
uk_ua: Файли для синхронізації

source: !WARNING! Full synchronization is not designed to synchronize a huge number of files. Firstly, it takes a lot of time, and secondly it will lead to an increase in the load on the server that might cause authorization of the host. With a large number of files is recommended that you synchronize files manually via FTP, and then use this plugin to sync.
be_by: !УВАГА! Поўная сінхранізацыя не прызначана для сінхранізацыі велізарнай колькасці файлаў. Па-першае, гэта зойме даволі шмат часу, па-другое гэта прывядзе да росту нагрузкі на сервер, што можа выклікаць санкцыі з боку хостынгу. Пры вялікай колькасці файлаў рэкамендуецца спачатку сінхранізаваць файлы праз FTP ўручную, а затым ужо выкарыстаць гэты убудова для сінхранізацыі.
uk_ua: !УВАГА! Повна синхронізація не призначена для синхронізації величезної кількості файлів. По-перше, це займе досить багато часу, по-друге це призведе до зростання навантаження на сервер, що може викликати санкції з боку хостингу. При великій кількості файлів рекомендується спочатку синхронізувати файли через FTP вручну, а потім вже використовувати цей плагін для синхронізації в автоматичному режимі знову додаються файлів.

source: You can always help the development of plug-in and contribute to the emergence of new functionality.
be_by: Вы заўсёды можаце дапамагчы развіццю плагіна і спрыяюць з'яўленню новай функцыянальнасці.
uk_ua: Ви завжди можете допомогти розвитку плагіна і сприяти появі нової функціональності

source: If you have any ideas or suggestions
be_by: Калі ў вас ёсць ідэі ці прапановы
uk_ua: Якщо у вас є ідеї або пропозиції

source: contact the author
be_by: звязацца з аўтарам
uk_ua: зв'язатись із автором

source: You can always thank the author of financially.
be_by: Вы заўсёды можаце падзякаваць аўтару матэрыяльна.
uk_ua: Ви завжди можете подякувати автора матеріально

source: Yandex.Money
be_by: Яндэкс.Грошы

source: Plugin Selectel Cloud Uploader requires PHP 5.3.3 or higher. The plugin has now disabled itself.
be_by: Для працы ўбудовы Selectel Cloud Upload неабходна, каб версія PHP была не ніжэй, чым 5.3.3. Убудова зараз адключана.
uk_ua: Для роботи плагіна Selectel Cloud Upload необхідно, щоб версія PHP була не нижче 5.3.3. Плагін зараз відключений.

source: Plugin Selectel Cloud Uploader requires cURL 7.16.2+. The plugin has now disabled itself.
be_by: Для працы ўбудовы Selectel Cloud Upload неабходна, каб версія cURL была не ніжэй, чым 7.16.2+. Убудова зараз адключана.
uk_ua: Для роботи плагіна Selectel Cloud Upload необхідно, щоб версія cURL була не нижче 7.16.2+. Плагін зараз відключений.

source: Plugin Selectel Cloud Uploader requires that cURL is compiled with OpenSSL. The plugin has now disabled itself.
be_by: Для працы ўбудовы Selectel Cloud Upload неабходна, каб cURL быў скампіляваны з падтрымкай OpenSSL. Убудова зараз адключана.
uk_ua: Для роботи плагіна Selectel Cloud Upload необхідно, щоб cURL було скомпільовано з підтримкою OpenSSL. Плагін зараз відключений.

source: Unable to connect to the container
uk_ua: Не вдається підключитися до контейнеру
